server/app/controllers/v1/items_controller.rb

    def create
      @product.items.create!(item_params)
---
INSERT INTO "items" ("waist", "length", "product_id", "style", "product_key", "count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["waist", 32], ["length", 32], ["product_id", 1], ["style", "string"], ["product_key", 2], ["count", 19], ["created_at", "2018-04-21 06:23:05.691181"], ["updated_at", "2018-04-21 06:23:05.691181"]]

    def set_product
      @product = Product.find(params[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def set_product_item
      @item = @product.items.find_by!(id: params[:id]) if @product
---
SELECT "items".* FROM "items" WHERE "items"."product_id" = $1  [["product_id", 7]]