server/app/controllers/v1/products_controller.rb

    def index
      @products = Product.search(product_name: params[:product_name]).paginate(page: params[:page], per_page: 20)
---
SELECT  "products".* FROM "products" WHERE "products"."product_name" = $1 LIMIT $2 OFFSET $3  [["product_name", "washed chinos"], ["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products" WHERE "products"."product_name" = $1  [["product_name", "washed chinos"]]

    def create
      @product = Product.create!(product_params)
---
INSERT INTO "products" ("product_key", "product_name", "product_image", "product_description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"