app/controllers/products_controller.rb

INSERT INTO "products" ("product_id", "product_name", "product_image", "product_description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @product = Product.create!(product_params)

UPDATE "products" SET "product_id" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["product_id", 2], ["updated_at", "2018-04-21 05:28:05.500180"], ["id", 1]]
---
  def update
    @product.update(product_params)